ðŸŸ¦ 1. Sample DataFrame

In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [22, 35, 40, 28, 19],
    "salary": [50000, 80000, 120000, 65000, 30000],
    "city": ["Toronto", "Toronto", "Montreal", "Vancouver", "Toronto"],
    "department": ["IT", "HR", "IT", "Finance", "HR"]
})

df

      name  age  salary       city department
0    Alice   22   50000    Toronto         IT
1      Bob   35   80000    Toronto         HR
2  Charlie   40  120000   Montreal         IT
3    David   28   65000  Vancouver    Finance
4      Eva   19   30000    Toronto         HR

ðŸŸ¦ 2. Modifying Values using .loc and .iloc

2.1 Change a single cell

In [10]:
df.loc[0, "salary"] = 55000
df

      name  age  salary       city department
0    Alice   22   55000    Toronto         IT
1      Bob   35   80000    Toronto         HR
2  Charlie   40  120000   Montreal         IT
3    David   28   65000  Vancouver    Finance
4      Eva   19   30000    Toronto         HR

In [11]:
df.iloc[1, 2] = 85000
df

      name  age  salary       city department
0    Alice   22   55000    Toronto         IT
1      Bob   35   85000    Toronto         HR
2  Charlie   40  120000   Montreal         IT
3    David   28   65000  Vancouver    Finance
4      Eva   19   30000    Toronto         HR

2.2 Change an entire column

In [12]:
df.loc[:, "salary"] = df["salary"] * 1.05   # 5% raise
df

      name  age  salary       city department
0    Alice   22   57750    Toronto         IT
1      Bob   35   89250    Toronto         HR
2  Charlie   40  126000   Montreal         IT
3    David   28   68250  Vancouver    Finance
4      Eva   19   31500    Toronto         HR

2.3 Change multiple selected rows

In [13]:
df.loc[[0, 2], "city"] = "Ottawa"
df

      name  age  salary       city department
0    Alice   22   57750     Ottawa         IT
1      Bob   35   89250    Toronto         HR
2  Charlie   40  126000     Ottawa         IT
3    David   28   68250  Vancouver    Finance
4      Eva   19   31500    Toronto         HR

ðŸŸ¦ 3. Conditional Value Updates

In [ ]:
# Give a bonus to people earning less than 60k
df.loc[df["salary"] < 60000, "salary"] += 10000
df

      name  age  salary       city department
0    Alice   22   67750     Ottawa         IT
1      Bob   35   89250    Toronto         HR
2  Charlie   40  126000     Ottawa         IT
3    David   28   68250  Vancouver    Finance
4      Eva   19   41500    Toronto         HR

In [15]:
# Modify based on multiple conditions
df.loc[
    (df["city"] == "Toronto") & (df["department"] == "HR"),
    "salary"
] += 5000
df

      name  age  salary       city department
0    Alice   22   67750     Ottawa         IT
1      Bob   35   94250    Toronto         HR
2  Charlie   40  126000     Ottawa         IT
3    David   28   68250  Vancouver    Finance
4      Eva   19   46500    Toronto         HR

ðŸŸ¦ 4. Replacing Values using .replace()

4.1 Replace a single value

In [18]:
df["city"] = df["city"].replace("Vancouver", "Quebec")
df

      name  age  salary     city department
0    Alice   22   67750   Ottawa         IT
1      Bob   35   94250  Toronto         HR
2  Charlie   40  126000   Ottawa         IT
3    David   28   68250   Quebec    Finance
4      Eva   19   46500  Toronto         HR

4.2 Replace multiple values at once

In [19]:
df["department"] = df["department"].replace({
    "IT": "Technology",
    "HR": "Human Resources"
})
df

      name  age  salary     city       department
0    Alice   22   67750   Ottawa       Technology
1      Bob   35   94250  Toronto  Human Resources
2  Charlie   40  126000   Ottawa       Technology
3    David   28   68250   Quebec          Finance
4      Eva   19   46500  Toronto  Human Resources

4.3 Replace numeric values

In [21]:
df["salary"] = df["salary"].replace({126000: 120000, 68250: 70000})
df

      name  age  salary     city       department
0    Alice   22   67750   Ottawa       Technology
1      Bob   35   94250  Toronto  Human Resources
2  Charlie   40  120000   Ottawa       Technology
3    David   28   70000   Quebec          Finance
4      Eva   19   46500  Toronto  Human Resources

ðŸŸ¦ 5. Changing Multiple Rows / Columns at Once

5.1 Modify multiple columns together

In [22]:
df.loc[:, ["age", "salary"]] = df[["age", "salary"]] * [1, 1.1]
df

/var/folders/fc/mkj1rmtd1fxdvgn96m4pmp1w0000gn/T/ipykernel_95565/1761520048.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[ 74525. 103675. 132000.  77000.  51150.]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:, ["age", "salary"]] = df[["age", "salary"]] * [1, 1.1]

      name  age    salary     city       department
0    Alice   22   74525.0   Ottawa       Technology
1      Bob   35  103675.0  Toronto  Human Resources
2  Charlie   40  132000.0   Ottawa       Technology
3    David   28   77000.0   Quebec          Finance
4      Eva   19   51150.0  Toronto  Human Resources

5.2 Update a range of rows

In [23]:
df.loc[1:3, ["salary", "age"]] = [90000, 30]
df

      name  age   salary     city       department
0    Alice   22  74525.0   Ottawa       Technology
1      Bob   30  90000.0  Toronto  Human Resources
2  Charlie   30  90000.0   Ottawa       Technology
3    David   30  90000.0   Quebec          Finance
4      Eva   19  51150.0  Toronto  Human Resources

ðŸŸ¦ 6. Safely Updating a Subset of Data

In [25]:
#ðŸš« Bad practice (may cause warning)

subset = df[df["city"] == "Toronto"]
subset["salary"] = subset["salary"] * 1.1  # Dangerous

/var/folders/fc/mkj1rmtd1fxdvgn96m4pmp1w0000gn/T/ipykernel_95565/3894016513.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset["salary"] = subset["salary"] * 1.1  # Dangerous

In [26]:
# âœ… Safe way using .loc
df.loc[df["city"] == "Toronto", "salary"] *= 1.1

In [27]:
# âœ… Safe update after creating a copy

subset = df[df["city"] == "Toronto"].copy()
subset["salary"] *= 1.1
subset

  name  age    salary     city       department
1  Bob   30  108900.0  Toronto  Human Resources
4  Eva   19   61891.5  Toronto  Human Resources

ðŸŸ¦ 7. Adding New Columns with Conditions

7.1 Create a senior column

In [29]:
df["senior"] = False
df.loc[df["age"] > 23, "senior"] = True
df

      name  age   salary     city       department  senior
0    Alice   22  74525.0   Ottawa       Technology   False
1      Bob   30  99000.0  Toronto  Human Resources    True
2  Charlie   30  90000.0   Ottawa       Technology    True
3    David   30  90000.0   Quebec          Finance    True
4      Eva   19  56265.0  Toronto  Human Resources   False

7.2 Update Using apply()

In [30]:
df["adjusted_salary"] = df.apply(
    lambda row: row["salary"] * 1.1 if row["city"] == "Toronto" else row["salary"],
    axis=1
)
df

      name  age   salary     city       department  senior  adjusted_salary
0    Alice   22  74525.0   Ottawa       Technology   False          74525.0
1      Bob   30  99000.0  Toronto  Human Resources    True         108900.0
2  Charlie   30  90000.0   Ottawa       Technology    True          90000.0
3    David   30  90000.0   Quebec          Finance    True          90000.0
4      Eva   19  56265.0  Toronto  Human Resources   False          61891.5

# âœ… Summary Table

| Task                    | Method                               |
| ----------------------- | ------------------------------------ |
| Modify single cell      | `.loc[row, col]` / `.iloc[row, col]` |
| Conditional update      | `.loc[condition, col] = value`       |
| Replace values          | `.replace()`                         |
| Update multiple columns | `.loc[:, cols] = values`             |
| Avoid warnings          | Always use `.loc` or `.copy()`       |